<a href="https://colab.research.google.com/github/hemrajojha/CSC410/blob/main/Unit_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
#https://beingdatum.com/data-preprocessing/#:~:text=Data%20Preprocessing%20with%20Python%20Data%20preprocessing%20involves%20the,directly%20affect%20the%20outcomes%20of%20any%20analytic%20algorithm.
#Data preprocessing involves the transformation of the raw dataset into an understandable format

In [2]:
#Steps In Data Preprocessing:
#Gathering the data
#Import the dataset & Libraries
#Dealing with Missing Values
#Divide the dataset into Dependent & Independent variable
#dealing with Categorical values
#Split the dataset into training and test set
#Feature Scaling

In [3]:
#datasets
#https://www.kaggle.com/shaktisharma/part-1-data-preprocessing?select=Data.csv (includes python solutions)
#for practice
#https://www.kaggle.com/rishabhsingh98/social-network-ads

In [4]:
import numpy as np
import pandas as pd

In [5]:
#setup google drive
from google.colab import drive

In [6]:
#mount drive
drive.mount('/content/drive')

Mounted at /content/drive

In [7]:
#locate file in google drive (uploaded it separately)
dataset = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/pre-data.csv')

In [8]:
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [9]:
#dealing with missing values
#Sometimes we may find some data are missing in the dataset. 
#if we found then we will remove those rows or we can calculate either mean, mode or median of the feature and replace it with missing values. 
#This is an approximation which can add variance to the dataset.

#check for null values
#With the help of info() we can found total number of entries as well as count of non-null values with datatype of all features.
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

In [10]:
#we also can use dataset.isna() to see the of null values in our dataset.
dataset.isna()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [11]:
#for large datasets
dataset.isna().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [12]:
#As we can see ‘Age’ and ‘Salary’ containing null values.

#drop null values
#Pandas provide a dropna() function that can be used to drop either row or columns with missing data. 
#We can use dropna() to remove all the rows with missing data.
dataset_1 = dataset.dropna()

In [13]:
dataset_1

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [14]:
#Replacing Null values with Strategy:
#For replacing null values we use the strategy that can be applied on a feature which has numeric data. 
#We can calculate the Mean, Median or Mode of the feature and replace it with the missing values.
dataset.fillna(dataset.mean(),inplace=True)

In [15]:
dataset

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

In [16]:
#In the above line of code, it will affect the entire data-set and replaces every variable null values with their respective mean, and ‘inplace =True’ indicates to affect the changes to dataset.
#If we need to replace particular variable with the strategies then we can use above line of code.
dataset['Age'].fillna(dataset['Age'].mean(),inplace=True)
dataset['Salary'].fillna(dataset['Salary'].mean(),inplace=True)

In [17]:
dataset

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

In [18]:
#Divide the dataset into Dependent & Independent variable
#Basically dataset might be labeled or unlabeled, here i am considering labeled dataset for a machine learning classification problem and considering a small dataset for better understanding, in our dataset there is four columns Country, Age, Salary and Purchased, Actually It is a dataset of a shopping complex those handle the customer data who purchased that product or not.

#In our dataset there is three independent variables (Country, Age and Salary) and one dependent variable (Purchased) that we have to predict.
#To read the columns, we will use iloc of pandas (used to fix the indexes for selection) which takes two parameters — [row selection, column selection]
X = dataset.iloc[:,[0,1,2]]   #or X=dataset.iloc[:,:-1]
Y = dataset.iloc[:,[3]]       #or Y=dataset.iloc[:,-1:]

In [19]:
#Note:  : selects all, using [] helps you select multiple columns or rows, this is how to slice the dataset.